package a02staticdemo2;

public class jicheng {
    /*
     * 继承：extends,用这个关键字，可以让一个类与另一个类建立起继承的关系
     * 形式：class 子类 extends 父类
     * 继承内容
     * 构造方法 ：均不能继承,,,使用super()
     * 成员变量：均可以（public ,private都可以）,private变量不能直接使用设置，需要使用get,set等
     * 成员方法：可以加入到虚方法表的方法的继承，否则不行，(虚方法表中，方法不能被private,statoc,final修饰)
     * java只支持单继承（一个类只有一个父类），不支持多继承（python和c++都可以：一个子类用有多个父类）
     * 同时：支持多层继承：子类a继承父类b，父类b继承父类c 每个类都直接或者间接的继承与Object(java已经写的)
     * 继承中成员变量的访问顺序是：本方法局部变量——子类的成员——父类的成员，链式调用的时候，super只能调用一次
     */
    /*
     * 方法的重写：当父类的方法无法满足子类的使用，方法重写（方法名，形参列表都一样，返回值类型小于父类的），，，
     * 
     * @Override,放在重写的方法上一行 ，校验子类的语法是否正确。给编写者和虚拟机使用
     * 覆盖虚方发表，如果原本的方法无法加载到虚方法表内，那么就不存在重写
     */
    /*
     * 继承方法的访问特点
     * 1.子类的构造方法：都先访问父类的构造方法来完成父类数据空间的数据初始化
     * 子类的构造方法有super(),来访问父类的无参构造
     * this 本质是局部变量。表示当前调用者的地址
     * super 代表父类的储存空间
     */
}
